In [6]:
import numpy as np
import pandas as pd

In [7]:
"Abc".isdigit()
'5'.isdigit()

True

In [11]:
names=pd.Series(["Kreto","Andrew","Bandrey","6"])

In [12]:
names

0      Kreto
1     Andrew
2    Bandrey
3          6
dtype: object

In [13]:
names.str.isdigit()

0    False
1    False
2    False
3     True
dtype: bool

In [19]:
names.str.isalpha()

0     True
1     True
2     True
3    False
dtype: bool

In [20]:
names=pd.Series(["     Kreto    ","Andr;ew","      Bandrey","6"])

In [21]:
names

0         Kreto
1           Andr;ew
2           Bandrey
3                 6
dtype: object

In [39]:
names.str.replace(';',"").str.strip().str.upper()

0      KRETO
1     ANDREW
2    BANDREY
3          6
dtype: object

In [40]:
names

0         Kreto
1           Andr;ew
2           Bandrey
3                 6
dtype: object

In [43]:
def optimize(name):
    name=name.replace(';',"")
    name=name.strip()
    name=name.upper()
    return name

In [48]:
names.apply(optimize)

0      KRETO
1     ANDREW
2    BANDREY
3          6
dtype: object

In [49]:
pd.Series(np.vectorize(optimize)(names))

0      KRETO
1     ANDREW
2    BANDREY
3          6
dtype: object

In [50]:
names=['Kreto,ANDREW,BANDREY','Bobo,Bubu,Theebu']

In [52]:
names=pd.Series(names)

In [65]:
names.str.split(',',expand=True)

       0       1        2
0  Kreto  ANDREW  BANDREY
1   Bobo    Bubu   Theebu

In [72]:
from datetime import datetime
mydata=datetime.now()
mydata.year

2023

In [77]:
myser=pd.Series(['Aug 1,2003','31-12-2002','10-12-2021'])

In [78]:
pd.to_datetime(myser)

C:\Users\HP\AppData\Local\Temp\ipykernel_12940\2184848876.py:1: UserWarning: Parsing dates in DD/MM/YYYY format when dayfirst=False (the default) was specified. This may lead to inconsistently parsed dates! Specify a format to ensure consistent parsing.
  pd.to_datetime(myser)

0   2003-08-01
1   2002-12-31
2   2021-10-12
dtype: datetime64[ns]

In [79]:
pd.to_datetime(myser,dayfirst=True)

0   2003-08-01
1   2002-12-31
2   2021-12-10
dtype: datetime64[ns]

In [82]:
myser=pd.to_datetime(pd.Series(['Aug 1,2003','31-12-2002','12th of Nov,2012']),dayfirst=True)

In [84]:
myser[0].year

2003

In [91]:
styledata='12--9--2023'
pd.to_datetime(styledata,format='%d--%m--%Y')

#https://docs.python.org/3/library/datetime.html#strftime-and-strptime-format-codes

Timestamp('2023-09-12 00:00:00')

In [100]:
df=pd.read_csv('D:\\COURSES\\Python for Machine Learning & Data Science Masterclass\\1 - Introduction to Course\\03-Pandas\RetailSales_BeerWineLiquor.csv')

In [101]:
df
df['DATE']

0      1992-01-01
1      1992-02-01
2      1992-03-01
3      1992-04-01
4      1992-05-01
          ...
335    2019-12-01
336    2020-01-01
337    2020-02-01
338    2020-03-01
339    2020-04-01
Name: DATE, Length: 340, dtype: object

In [102]:
df['DATE']=pd.to_datetime(df['DATE'])

In [105]:
df.set_index('DATE')

            MRTSSM4453USN
DATE
1992-01-01           1509
1992-02-01           1541
1992-03-01           1597
1992-04-01           1675
1992-05-01           1822
...                   ...
2019-12-01           6630
2020-01-01           4388
2020-02-01           4533
2020-03-01           5562
2020-04-01           5207

[340 rows x 1 columns]

In [109]:
df=pd.read_csv('D:\\COURSES\\Python for Machine Learning & Data Science Masterclass\\1 - Introduction to Course\\03-Pandas\RetailSales_BeerWineLiquor.csv',parse_dates=[0])

In [110]:
df['DATE']

0     1992-01-01
1     1992-02-01
2     1992-03-01
3     1992-04-01
4     1992-05-01
         ...
335   2019-12-01
336   2020-01-01
337   2020-02-01
338   2020-03-01
339   2020-04-01
Name: DATE, Length: 340, dtype: datetime64[ns]

In [112]:
df=df.set_index('DATE')

In [113]:
df

            MRTSSM4453USN
DATE
1992-01-01           1509
1992-02-01           1541
1992-03-01           1597
1992-04-01           1675
1992-05-01           1822
...                   ...
2019-12-01           6630
2020-01-01           4388
2020-02-01           4533
2020-03-01           5562
2020-04-01           5207

[340 rows x 1 columns]

In [115]:
df.resample(rule='A').mean()  #groupby year of date
#http://pandas.pydata.org/pandas-docs/stable/user_guide/timeseries.html#offset-aliases

            MRTSSM4453USN
DATE
1992-12-31    1807.250000
1993-12-31    1794.833333
1994-12-31    1841.750000
1995-12-31    1833.916667
1996-12-31    1929.750000
1997-12-31    2006.750000
1998-12-31    2115.166667
1999-12-31    2206.333333
2000-12-31    2375.583333
2001-12-31    2468.416667
2002-12-31    2491.166667
2003-12-31    2539.083333
2004-12-31    2682.416667
2005-12-31    2797.250000
2006-12-31    3001.333333
2007-12-31    3177.333333
2008-12-31    3292.000000
2009-12-31    3353.750000
2010-12-31    3450.083333
2011-12-31    3532.666667
2012-12-31    3697.083333
2013-12-31    3839.666667
2014-12-31    4023.833333
2015-12-31    4212.500000
2016-12-31    4434.416667
2017-12-31    4602.666667
2018-12-31    4830.666667
2019-12-31    4972.750000
2020-12-31    4922.500000